//const 部 = '部'; //部首 Bushu -  radical
//const 旧 = '旧'; //旧字体 kyūjitai  / traditional  繁體字 Fántǐzì 
//const 新 = '新'; //新字体 shinjitai	/ simplified japanese
//const 简 = '简'; //简化字 jiǎnhuàzì  / simplified chinese
//const 外 = '外'; //表外字 hyōgaiji 
//'旧简外部'
厶.variants = {
刀: '刂⺈刁𠚣釖',
水: '⽔氺氵沝𡿭𣸕',
服: '𠬝𦨈𠬩𠬮𠬨𢻮𦨕𨈞𦩟𣍞𦨊𦨋𤰇𦯞𤰈𠃰鞴𫖉𩍁𩍘𮧳𩌎韛𩏕𩏄𩏦䪖𩏃箙𥵩', 

火: '灬⺣',
犬: '犭',
牛: '牜⺧𠂒',
辵: '⻌⻍辶',
攴: '攵䇚𢪊',
言: '訁讠',
止: '𣥂龰',
衣: '𧘇衤',
心: '忄㣺',
手: '扌龵𠂿𡴤⼿🈐',
爪: '爫⺤㕚抓',
人: '亻𠆢⺈儿几𠂉𠔽𤯔𦉫',
肉: '⺼𠕎𠕜宍𥤬𡧢𮌇脈脉𬁲',
示: '礻𡭕𥘅',
甲: '𠇚𡴌𤰒鉀钾𢓜徦到',
不: '不𠀚𠙐',
阜: '阝𨸏',
骨: '⻣',
糸: '糹纟絲丝',
鄉: '郷鄕乡鄊鄕',
傘: '伞繖𢄻𠋔𠌂𠍘𠎃𡙘𡙫𦇕仐',
烏: '乌𠂶𡖗𡗃𤚶𥾪鴉',
肅: '粛肃𦘛𦘡䏋𦘜𦘝𢙻',

黃: '黄𫜘𡕛',
來: '来𧼛麥𰙬逨徠徕倈俫勑𠡠耒',
麥: '麦來𬓡䅘𥟂麳𪎂𪎌𡖘𡕤',
為: '爲为𫞟',
羊: '⽺𦍌⺷⺶𦍋⺸',
書: '书𦘠𰭽',
晝: '昼書𦘙𦘘𣅯',
事: '亊𠭆𪜃𠄙𤔇𠁱𠫺叓㕝𠭏𡷮',
𧴪: '𭕆',
串: '𰀁',
金: '釒钅⻐𠊍𨤾𠉓𨥀𨥄',
長: '⻑⾧镸⻒长仧兏𠑷𠑻𠔊𠑿𨱘𠇬𠤐𨱗', //,'丈官司首',
龜: '龟亀𬺞𪚧𪚿𪚨𪚦𠃾𠁴𤕣',
黑: '黒𪐗𪐫',
樂: '樂樂樂藥楽乐㦡',
壺: '壷壷壶𠻭𡔥𡔦𡐎𢑹𥁖𡔳𡔲',
壽: '夀寿𡔽',
肏: '甫悑操草艸艹',
用: '⽤𠛁𤰃𠂵𤰆𡶤𠂦',
甩: '摔溴𫝺',
甩: '摔溴𫝺',
喪: '丧䘮',//https://chardb.iis.sinica.edu.tw/meancompare/55aa/462e
畢: '㪤毕罼鏎彃縪韠',
};
//異體字 (variant)
const KB_PRIMS_ALT = {



'祣':["旅"],
'甚':["𠥄","𠯕"],
'袁':["𡋡","𡊮"],
'𠑹':["𠒂","𧟣"],
'塁':["壘"],
'夀':["壽"],
'埓':["埒"],
'夹':["夾"],
'灵':["靈"],
'嵗':["歲"],
'敢':["攼"],
'煕':["熙"],

//'trad' : ['trad','simp','alt','shinj','jap']
'旁':['','㝑'],
'師':['','师'],
'齊':['','齐','','斉'],
'鬭':['鬥','鬬','斗','闘'],
'兩':['','两','','両','𭃂'],
//曲臣
//𧘇⺌⺍⺌
//CDP-8D46
//⿲⿺𠄌⺀⿺𠄌⺀㇂
//⿲⿺𠄌𠄠⿺𠄌𠄠㇂

}